"Add Field" = "Lisää selite";

"Album" = "Albumi";
"Artist" = "Artisti";
"Artwork" = "Kuvitus";
"Author" = "Tekijä";
"Comment" = "Kommentti";
"Composer" = "Säveltäjä";
"Copyright" = "Tekijänoikeus";
"Creation Date" = "Luontipäivä";
"Description" = "Kuvaus";
"Director" = "Ohjaaja";
"Disclaimer" = "Vastuun rajaus";
"Encoded By" = "Koodannut";
"Genre" = "Lajityyppi";
"Full Name" = "Koko nimi";
"Keywords" = "Avainsanat";
"Title" = "Otsikko";
"Information" = "Tiedot";
"Producer" = "Tuottaja";
"Edit Date" = "Muokkauspäivämäärä";
"Track Number" = "Raita";
"Performers" = "Esiintyjät";
"URL Link" = "Osoitelinkki";
"Playback Requirements" = "Toistovaatimukset";
"Original Artist" = "Alkuperäinen artisti";
"Original Source" = "Alkuperäinen lähde";
"Original Format" = "Alkuperäinen muoto";
"Software" = "Ohjelmisto";
"Product" = "Tuote";
"Warning" = "Varoitus";
"Writer" = "Kirjoittaja";
"Year" = "Vuosi";
